Repository: AmruthPillai/BeThriftyToday
Catalog: lib/l10n/intl_*.arb
Languages: kn

# addCategoryBottomSheetButtonTextAdd
source: ADD
kn: ಸೇರಿಸಿ

# addCategoryBottomSheetButtonTextCancel
source: CANCEL
kn: ರದ್ದುಮಾಡಿ

# addCategoryBottomSheetHeadingText
source: Add New {type} Category
kn: ಹೊಸ {type} ವರ್ಗವನ್ನು ಸೇರಿಸಿ

# addCategoryBottomSheetLabelTextCategoryName
source: Category Name
kn: ವರ್ಗದ ಹೆಸರು

# appName
source: Be Thrifty Today
kn: ಬಿ ತ್ರಿಫ್ತೀ ಟುಡೇ

# categoriesScreenAppBarTitle
source: Categories
kn: ವರ್ಗಗಳು

# categoriesScreenButtonTextAddNew
source: Add New
kn: ಹೊಸದನ್ನು ಸೇರಿಸಿ

# categoriesScreenSnackbarTextDeleteMessage
source: The category has been successfully deleted
kn: ನೀವು ಆಯ್ಕೆ ಮಾಡಿದ ವರ್ಗವನ್ನು ಅಳಿಸಲಾಗಿದೆ

# categoriesScreenSnackbarTextResetCategoriesAction
source: Yes
kn: ಹೌದು

# categoriesScreenSnackbarTextResetCategoriesConfirmation
source: Are you sure you want to reset all categories to the original?
kn: ಎಲ್ಲಾ ವರ್ಗಗಳನ್ನು ಮರುಹೊಂದಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?

# categoriesScreenSnackbarTextResetCategoriesSuccess
source: All categories have been reset successfully
kn: ಎಲ್ಲಾ ವರ್ಗಗಳನ್ನು ಮರುಹೊಂದಿಸಲಾಗಿದೆ

# categoriesScreenTabBarTextExpense
source: Expense
kn: ಖರ್ಚು

# categoriesScreenTabBarTextIncome
source: Income
kn: ಆದಾಯ

# categoryName
source: {category, select, Automobile {Automobile} Awards {Awards} BabyCare {Baby Care} Bonus {Bonus} Books {Books} Charity {Charity} Clothing {Clothing} Drinks {Drinks} Education {Education} Electronics {Electronics} Entertainment {Entertainment} Food {Food} Freelance {Freelance} FriendsFamily {Friends & Family} Gifts {Gifts} Grants {Grants} Groceries {Groceries} Health {Health} Hobbies {Hobbies} Insurance {Insurance} Interest {Interest} Investments {Investments} Laundry {Laundry} Lottery {Lottery} Mobile {Mobile} Office {Office} Others {Others} Pets {Pets} Refunds {Refunds} Rent {Rent} Salary {Salary} Sale {Sale} SalonSpa {Salon & Spa} Shopping {Shopping} Tax {Tax} Transportation {Transportation} Travel {Travel} Utilities {Utilities} other {{category}}}
kn: {category, select, Automobile {ಆಟೋಮೊಬೈಲ್} Awards {ಪ್ರಶಸ್ತಿಗಳು} BabyCare {ಬೇಬಿ ಕೇರ್} Bonus {ಬೋನಸ್} Books {ಪುಸ್ತಕಗಳು} Charity {ಚಾರಿಟಿ} Clothing {ಉಡುಪು} Drinks {ಪಾನೀಯಗಳು} Education {ಶಿಕ್ಷಣ} Electronics {ಎಲೆಕ್ಟ್ರಾನಿಕ್ಸ್} Entertainment {ಮನರಂಜನೆ} Food {ಆಹಾರ} Freelance {ಸ್ವತಂತ್ರ} FriendsFamily {ಸ್ನೇಹಿತರು ಮತ್ತು ಕುಟುಂಬ} Gifts {ಉಡುಗೊರೆಗಳು} Grants {ಧನಸಹಾಯ} Groceries {ದಿನಸಿ} Health {ಆರೋಗ್ಯ} Hobbies {ಆಸಕ್ತಿಗಳು} Insurance {ವಿಮೆ} Interest {ಆಸಕ್ತಿ} Investments {ಇನ್ವೆಸ್ಟ್ಮೆಂಟ್ಸ್} Laundry {ಲಾಂಡ್ರಿ} Lottery {ಲಾಟರಿ} Mobile {ಮೊಬೈಲ್} Office {ಕಚೇರಿ} Others {ಇತರೆ} Pets {ಸಾಕುಪ್ರಾಣಿಗಳು} Refunds {ಹಣವು} Rent {ಬಾಡಿಗೆ} Salary {ಸಂಬಳ} Sale {ಮಾರಾಟ} SalonSpa {ಸಲೂನ್ ಮತ್ತು ಸ್ಪಾ} Shopping {ಶಾಪಿಂಗ್} Tax {ತೆರಿಗೆ} Transportation {ಸಾರಿಗೆ} Travel {ಪ್ರಯಾಣ} Utilities {ಉಪಯುಕ್ತತೆಗಳನ್ನು} other {{category}}}

# currenciesScreenAppBarTitle
source: Currencies
kn: ಕರೆನ್ಸಿಗಳು

# currenciesScreenSnackbarTextResetCurrenciesAction
source: Yes
kn: ಹೌದು

# currenciesScreenSnackbarTextResetCurrenciesConfirmation
source: Are you sure you want to reset all currencies to the original?
kn: ಎಲ್ಲಾ ಕರೆನ್ಸಿಗಳನ್ನು ಮರುಹೊಂದಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?

# currenciesScreenSnackbarTextResetCurrenciesSuccess
source: All currencies have been reset successfully
kn: ಎಲ್ಲಾ ಕರೆನ್ಸಿಗಳನ್ನು ಮರುಹೊಂದಿಸಲಾಗಿದೆ

# currencySetupTextHeadline
source: What's your currency?
kn: ನಿಮ್ಮ ಕರೆನ್ಸಿ ಯಾವುದು?

# deleteAccountDialogButtonTextCancel
source: No, I don't want to leave!
kn: ಇಲ್ಲ, ನಾನು ಬಿಡುವುದಿಲ್ಲ!

# deleteAccountDialogButtonTextDelete
source: Yes, delete my data!
kn: ಹೌದು, ನನ್ನ ಡೇಟಾವನ್ನು ಅಳಿಸಿ!

# deleteAccountDialogContent
source: You will lose all the data (including profile information and your transaction history) when you delete your account. This is an irreversible process, are you sure you want to go through with it?
kn: ನಿಮ್ಮ ಖಾತೆಯನ್ನು ಅಳಿಸಿದಾಗ ನೀವು ಎಲ್ಲಾ ಡೇಟಾವನ್ನು ಕಳೆದುಕೊಳ್ಳುತ್ತೀರಿ. ಇದು ಬದಲಾಯಿಸಲಾಗದ ಪ್ರಕ್ರಿಯೆ, ನೀವು ಮುಂದುವರಿಯಲು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?

# deleteAccountDialogTitle
source: Do you really want to delete your account?
kn: ನಿಮ್ಮ ಖಾತೆಯನ್ನು ಅಳಿಸಲು ನೀವು ಬಯಸುವಿರಾ?

# exportBottomSheetButtonTextDownload
source: DOWNLOAD
kn: ಡೌನ್‌ಲೋಡ್

# exportBottomSheetButtonTextExport
source: EXPORT
kn: ಎಕ್ಸ್ಪೋರ್ಟ್

# exportBottomSheetHeadingText
source: Export as CSV/JSON
kn: CSV/JSON ಆಗಿ ಎಕ್ಸ್ಪೋರ್ಟ್ ಮಾಡಿ

# exportBottomSheetLabelTextEndDate
source: End Date
kn: ಅಂತಿಮ ದಿನಾಂಕ

# exportBottomSheetLabelTextStartDate
source: Start Date
kn: ಪ್ರಾರಂಭ ದಿನಾಂಕ

# exportBottomSheetTextDateValidationError
source: Start Date must be earlier than End Date
kn: ಪ್ರಾರಂಭ ದಿನಾಂಕವು ಅಂತಿಮ ದಿನಾಂಕಕ್ಕಿಂತ ಮುಂಚೆಯೇ ಇರಬೇಕು

# homeDailyNoTransactionsTextSubtitle
source: Tap on the + button below to add a new income/expense.
kn: ಹೊಸ ಆದಾಯ/ಖರ್ಚನ್ನು ಸೇರಿಸಲು ಕೆಳಗಿನ + ಬಟನ್ ಟ್ಯಾಪ್ ಮಾಡಿ.

# homeDailyNoTransactionsTextTitle
source: This list is looking a little bit empty...
kn: ಈ ಪಟ್ಟಿ ಸ್ವಲ್ಪ ಖಾಲಿಯಾಗಿದೆ...

# loginButtonTextGoogle
source: Login with Google
kn: ಗೂಗಲ್ ನೊಂದಿಗೆ ಲಾಗಿನ್ ಮಾಡಿ

# loginButtonTextGuest
source: Login as Guest
kn: ಅತಿಥಿಯಾಗಿ ಲಾಗಿನ್ ಮಾಡಿ

# loginTextTagline
source: Be Thrifty Today is a simple and secure money management app that helps you track your income and expenses.
kn: ಬಿ ತ್ರಿಫ್ತೀ ಟುಡೇ ಸರಳ ಮತ್ತು ಸುರಕ್ಷಿತವಾದ ಹಣ ನಿರ್ವಹಣಾ ಅಪ್ಲಿಕೇಶನ್‌ ಆಗಿದ್ದು ಅದು ನಿಮ್ಮ ಆದಾಯ ಮತ್ತು ಖರ್ಚಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.

# profileSetupButtonTextNext
source: NEXT
kn: ಮುಂದುವರಿಸಿ

# profileSetupLabelTextEmailAddress
source: Email Address
kn: ಇಮೇಲ್ ವಿಳಾಸ

# profileSetupLabelTextFullName
source: Full Name
kn: ಪೂರ್ಣ ಹೆಸರು

# profileSetupTextHeadline
source: Who are you?
kn: ನೀವು ಯಾರು?

# settingsScreenHeaderTitleAccount
source: Account
kn: ಖಾತೆ

# settingsScreenHeaderTitleDangerZone
source: Danger Zone
kn: ಅಪಾಯ ವಲಯ

# settingsScreenHeaderTitlePreferences
source: Preferences
kn: ಆದ್ಯತೆಗಳು

# settingsScreenSettingTitleAccentColor
source: Accent Color
kn: ಬಣ್ಣ

# settingsScreenSettingTitleBiometric
source: Biometric Security
kn: ಬಯೋಮೆಟ್ರಿಕ್ ಭದ್ರತೆ

# settingsScreenSettingTitleBiometricDescription
source: Asks for your fingerprint every time you open the app.
kn: ನೀವು ಪ್ರತಿ ಬಾರಿ ಅಪ್ಲಿಕೇಶನ್ ತೆರೆದಾಗ ನಿಮ್ಮ ಫಿಂಗರ್‌ಪ್ರಿಂಟ್ ಕೇಳುತ್ತದೆ.

# settingsScreenSettingTitleCurrency
source: Currency
kn: ಕರೆನ್ಸಿ

# settingsScreenSettingTitleDeleteAccount
source: Delete Account
kn: ಖಾತೆಯನ್ನು ಅಳಿಸಿ

# settingsScreenSettingTitleEmailAddress
source: Email Address
kn: ಇಮೇಲ್ ವಿಳಾಸ

# settingsScreenSettingTitleLanguage
source: Language
kn: ಭಾಷೆ

# settingsScreenSettingTitleName
source: Full Name
kn: ಪೂರ್ಣ ಹೆಸರು

# settingsScreenSettingTitleTheme
source: Theme
kn: ಥೀಮ್

# settingsScreenSettingTitleThemeAMOLED
source: AMOLED
kn: ಅಮೋಲೆಡ್

# settingsScreenSettingTitleThemeDark
source: Dark
kn: ಡಾರ್ಕ್

# settingsScreenSettingTitleThemeLight
source: Light
kn: ಲೈಟ್

# thriftyDrawerMessageShare
source: Check out this app that helps you manage your income and expenses, safe and secure: https://pillai.xyz/thrifty
kn: ನಿಮ್ಮ ಆದಾಯ ಮತ್ತು ಖರ್ಚಗಳನ್ನು ಸರಳ ಮತ್ತು ಸುರಕ್ಷಿತವಾಗಿ ನಿರ್ವಹಿಸಲು ಸಹಾಯ ಮಾಡುವ ಈ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ: https://pillai.xyz/thrifty

# thriftyDrawerTextAbout
source: About the App
kn: ಅಪ್ಲಿಕೇಶನ್ ಬಗ್ಗೆ

# thriftyDrawerTextAboutAppLegalese
source: This application is open-source and free-to-use, governed under the Apache License 2.0. If you are a developer, please feel free to contribute to the application on GitHub.
kn: ಈ ಅಪ್ಲಿಕೇಶನ್ ತೆರೆದ ಮೂಲ ಮತ್ತು ಬಳಸಲು ಮುಕ್ತವಾಗಿದೆ, ಇದನ್ನು ಅಪಾಚೆ ಪರವಾನಗಿ 2.0 ಅಡಿಯಲ್ಲಿ ನಿಯಂತ್ರಿಸಲಾಗುತ್ತದೆ. ನೀವು ಡೆವಲಪರ್ ಆಗಿದ್ದರೆ, ದಯವಿಟ್ಟು GitHub ನಲ್ಲಿ ಅಪ್ಲಿಕೇಶನ್‌ಗೆ ಕೊಡುಗೆ ನೀಡಲು ಹಿಂಜರಿಯಬೇಡಿ.

# thriftyDrawerTextAboutFooter
source: If you love the app and use it regularly, please donate as little as you can, enough to keep the app alive and running on its own. Donation details can be found on the GitHub homepage or the website. Thank you so much!
kn: ನೀವು ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಪ್ರೀತಿಸುತ್ತಿದ್ದರೆ ಮತ್ತು ಅದನ್ನು ನಿಯಮಿತವಾಗಿ ಬಳಸುತ್ತಿದ್ದರೆ, ದಯವಿಟ್ಟು ನಿಮ್ಮಿಂದ ಸಾಧ್ಯವಾದಷ್ಟು ಕಡಿಮೆ ದಾನ ಮಾಡಿ, ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಜೀವಂತವಾಗಿಡಲು ಮತ್ತು ಸ್ವಂತವಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸಲು ಸಾಕು. ನಿಮ್ಮ ಸ್ವಂತ ಭಾಷೆಗೆ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಭಾಷಾಂತರಿಸುವ ಮೂಲಕ ನೀವು ಸಹ ಕೊಡುಗೆ ನೀಡಬಹುದು. ತುಂಬಾ ಧನ್ಯವಾದಗಳು!

# thriftyDrawerTextCategories
source: Categories
kn: ವರ್ಗಗಳು

# thriftyDrawerTextCurrencies
source: Currencies
kn: ಕರೆನ್ಸಿಗಳು

# thriftyDrawerTextExport
source: Export to JSON/CSV
kn: CSV/JSON ಆಗಿ ಎಕ್ಸ್ಪೋರ್ಟ್ ಮಾಡಿ

# thriftyDrawerTextLogout
source: Logout
kn: ಲಾಗ್ ಔಟ್

# thriftyDrawerTextRate
source: Rate the App
kn: ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ರೇಟ್ ಮಾಡಿ

# thriftyDrawerTextSettings
source: Settings
kn: ಆದ್ಯತೆಗಳು

# thriftyDrawerTextShare
source: Spread the Love
kn: ಅಪ್ಲಿಕೇಶನ್ ಶೇರ್ ಮಾಡಿ

# thriftyOverviewTextBalanceHeading
source: YOUR BALANCE
kn: ನಿಮ್ಮ ಕೈಚೀಲ

# thriftyOverviewTextBudgetSet
source: You have spent {symbol} {spendAmount} of your total budget of {symbol} {budgetAmount} in the month of {monthYear}.
kn: {monthYear} ರಲ್ಲಿ ನಿಮ್ಮ ಒಟ್ಟು {symbol} {budgetAmount} ಬಜೆಟ್‌ನಲ್ಲಿ {symbol} {spendAmount} ಖರ್ಚು ಮಾಡಿದ್ದೀರಿ.

# thriftyOverviewTextBudgetUnset
source: Tap here to set a monthly budget and manage your expenses efficiently.
kn: ಮಾಸಿಕ ಬಜೆಟ್ ಹೊಂದಿಸಲು ಇಲ್ಲಿ ಟ್ಯಾಪ್ ಮಾಡಿ ಮತ್ತು ನಿಮ್ಮ ಖರ್ಚಗಳನ್ನು ಸಮರ್ಥವಾಗಿ ನಿರ್ವಹಿಸಿ.

# transactionBottomSheetButtonTextAdd
source: ADD
kn: ಸೇರಿಸಿ

# transactionBottomSheetButtonTextExpense
source: Expense
kn: ಖರ್ಚು

# transactionBottomSheetButtonTextIncome
source: Income
kn: ಆದಾಯ

# transactionBottomSheetButtonTextUpdate
source: UPDATE
kn: ನವೀಕರಿಸಿ

# transactionBottomSheetLabelTextAmount
source: Amount
kn: ಅಮೌಂಟ್

# transactionBottomSheetLabelTextDate
source: Date
kn: ದಿನಾಂಕ

# transactionBottomSheetLabelTextDescription
source: Description (optional)
kn: ವಿವರಣೆ (ಅಗತ್ಯವಿಲ್ಲ)

# transactionBottomSheetTextHeadingAdd
source: Add New Transaction
kn: ಹೊಸ ವಹಿವಾಟು ಸೇರಿಸಿ

# transactionBottomSheetTextHeadingUpdate
source: Update Transaction
kn: ವಹಿವಾಟನ್ನು ನವೀಕರಿಸಿ

# transactionListHiddenTransactionText
source: {howMany, plural, one {1 transaction hidden} other {{howMany} transactions hidden}}
kn: {howMany, plural, one {1 ವಹಿವಾಟನ್ನು ಮರೆಮಾಡಲಾಗಿದೆ} other {{howMany} ವಹಿವಾಟುಗಳನ್ನು ಮರೆಮಾಡಲಾಗಿದೆ}}

# updateBudgetBottomSheetButtonTextClear
source: CLEAR
kn: ರದ್ದುಮಾಡಿ

# updateBudgetBottomSheetButtonTextSetBudget
source: SET BUDGET
kn: ಬಜೆಟ್ ಹೊಂದಿಸಿ

# updateBudgetBottomSheetHeadingText
source: Please enter a monthly budget that you feel is conservative according to your spending habits.
kn: ನಿಮ್ಮ ಖರ್ಚು ಅಭ್ಯಾಸಕ್ಕೆ ಅನುಗುಣವಾಗಿ ಸಂಪ್ರದಾಯವಾದಿ ಎಂದು ನೀವು ಭಾವಿಸುವ ಮಾಸಿಕ ಬಜೆಟ್ ಅನ್ನು ದಯವಿಟ್ಟು ನಮೂದಿಸಿ.

# updateBudgetBottomSheetLabelTextBudget
source: Budget
kn: ಬಜೆಟ್
